common/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `nb_user` WHERE (`username`='aaaaaa') AND (`status`=10)